In [3]:
import pandas as pd
import numpy as np

In [16]:
'create pandas'
data = pd.DataFrame(columns=['A','B','C'])
data['A'] = np.linspace(0,100)
data['B'] = np.linspace(10,500)
data.head()

          A     B    C
0  0.000000  10.0  NaN
1  2.040816  20.0  NaN
2  4.081633  30.0  NaN
3  6.122449  40.0  NaN
4  8.163265  50.0  NaN

In [17]:
'sorted'
data = data.sort_values(by=['A'])
data.head()

          A     B    C
0  0.000000  10.0  NaN
1  2.040816  20.0  NaN
2  4.081633  30.0  NaN
3  6.122449  40.0  NaN
4  8.163265  50.0  NaN

In [ ]:
'duplicates,default:keep first item(first,last)'

data = data.drop_duplicates(['$company_id'],'first')